// 몇가지 단계를 거치면서 두 숫자를 더하여 합계를 반환하는 함수를 작성해 보자

// 1. 문제를 내 방식대로 다시 생각할수 있는가?
// => '두 숫자의 덧셈'

// 2. 문제가 어떤 입력값을 담고 있는가를 이해해야함
// 3. 문제에 대한 해결책에서 나와야하는 출력값은 무엇인가
// => 정수인가 부동 소수점인가, 항상 입력은 두개인가, 얼마나 큰 숫자인가, 부동소수점을 입력받으면 부동소수점이 나와야 하는가
// 큰 숫자의 덧세을 수행하면서 문자열이 문자열을 반환하도록 할것인지 등...

// 4. 입력값이 출력값을 결정할 수 있을것인가?
// => 누군가가 한 숫자만 입력한다면 어떻게 될까?
// 0을 더할것인가? undefined, null?
// 면접관에게 물어라. 대부분 당장은 무시하라고 말할것.
// 대부분의 면접 상황에서 두 숫자가 필요한 함수를 작성하여 합계륽 반환하라고 요구하지도 않을것.

// 5. 문제의 일부인 데이터의 중요한 부분에 어떻게 라벨을 지정할수 있을까?
// 무엇이 중요한가에 대해 생각부터 하는게 중요.
// 우리에게 필요한 전부는 입력값과 출력값 이 두가지.
// 예를들어 add 함수에 이어 인수인 num1 과 num2 를 입력
// 그리고 sum 이 반환될 결과가 되도록 해주자

// 더 복잡한 문제가 생기기 시작하면 단계별로 생각하는것이 차이를 만들 수 있다.
